tests/http_readiness_mutants/handoff-drain-off.patch
diff --git a/src/ext_http.c b/src/ext_http.c
--- a/src/ext_http.c
+++ b/src/ext_http.c
@@ -284,8 +284,10 @@
             /* Shutdown ends accepting only. Every already-accepted fd still
              * gets an honest startup response; none is silently dropped. */
             for (int i = 0; i < n; i++) {
-                int complete = clients[i].line && strstr(clients[i].line, "\r\n") != NULL;
-                init_conn_reply(s, &clients[i], complete);
+                free(clients[i].line);
+                close(clients[i].fd);
+                clients[i].line = NULL;
+                clients[i].fd = -1;
             }
             break;
         }
