tests/http_readiness_mutants/header-omitted-in-init-window.patch
diff --git a/src/ext_http.c b/src/ext_http.c
--- a/src/ext_http.c
+++ b/src/ext_http.c
@@ -247,11 +247,20 @@
          strncmp(version, "HTTP/1.0\r\n", 10) == 0);
     tls_write_nowait = 1;
-    send_response_full(c->fd, live ? 200 : 503,
-                       live ? "OK" : "Service Unavailable", "text/plain",
-                       live ? "OK" : "Server initializing\n", live ? 2 : 20,
-                       1, live ? "" : "Retry-After: 1\r\n");
+    {
+        const char *st = live ? "OK" : "Service Unavailable";
+        const char *body = live ? "OK" : "Server initializing\n";
+        int blen = live ? 2 : 20;
+        char hdr[512];
+        int hn = snprintf(hdr, sizeof hdr,
+            "HTTP/1.1 %d %s\r\nContent-Type: text/plain\r\nContent-Length: %d\r\n"
+            "Cache-Control: no-cache\r\nConnection: close\r\n%s\r\n",
+            live ? 200 : 503, st, blen, live ? "" : "Retry-After: 1\r\n");
+        ssize_t w = write(c->fd, hdr, (size_t)hn);
+        (void)w;
+        if (!tls_suppress_body) { w = write(c->fd, body, (size_t)blen); (void)w; }
+    }
     tls_write_nowait = 0;
     free(c->line);
     close(c->fd);
     c->line = NULL;
