tests/http_readiness_mutants/header-omitted-on-per-ip-cap.patch
diff --git a/src/ext_http.c b/src/ext_http.c
--- a/src/ext_http.c
+++ b/src/ext_http.c
@@ -1812,8 +1812,14 @@
         if (!ip_conn_acquire(caddr)) {
             tls_suppress_body = 1;
-            send_response_full(client_fd, 503, "Service Unavailable", "text/plain",
-                               "", 0, 0, "");
+            const char *busy =
+                "HTTP/1.1 503 Service Unavailable\r\n"
+                "Content-Type: text/plain\r\n"
+                "Content-Length: 0\r\n"
+                "Connection: close\r\n"
+                "\r\n";
+            ssize_t bw = write(client_fd, busy, strlen(busy));
+            (void)bw;
             tls_suppress_body = 0;
             close(client_fd);
             continue;
