tests/http_readiness_mutants/header-omitted-on-per-ip-cap.patch
diff --git a/src/ext_http.c b/src/ext_http.c
--- a/src/ext_http.c
+++ b/src/ext_http.c
@@ -1779,8 +1779,15 @@
          * Shed with 503 before spending a worker on it. */
         uint32_t caddr = client_addr.sin_addr.s_addr;
         if (!ip_conn_acquire(caddr)) {
-            send_response_full(client_fd, 503, "Service Unavailable", "text/plain",
-                               "Too many connections\n", 21, 0, "");
+            const char *busy =
+                "HTTP/1.1 503 Service Unavailable\r\n"
+                "Content-Type: text/plain\r\n"
+                "Content-Length: 21\r\n"
+                "Connection: close\r\n"
+                "\r\n"
+                "Too many connections\n";
+            ssize_t bw = write(client_fd, busy, strlen(busy));
+            (void)bw;
             close(client_fd);
             continue;
         }
