tests/http_readiness_mutants/init-reply-write-blocking.patch
diff --git a/src/ext_http.c b/src/ext_http.c
--- a/src/ext_http.c
+++ b/src/ext_http.c
@@ -246,12 +246,10 @@
         (strncmp(version, "HTTP/1.1\r\n", 10) == 0 ||
          strncmp(version, "HTTP/1.0\r\n", 10) == 0);
-    tls_write_nowait = 1;
     send_response_full(c->fd, live ? 200 : 503,
                        live ? "OK" : "Service Unavailable", "text/plain",
                        live ? "OK" : "Server initializing\n", live ? 2 : 20,
                        1, live ? "" : "Retry-After: 1\r\n");
-    tls_write_nowait = 0;
     free(c->line);
     close(c->fd);
     c->line = NULL;
