tests/http_readiness_mutants/name-check-allows-delims.patch
diff --git a/src/ext_http.c b/src/ext_http.c
--- a/src/ext_http.c
+++ b/src/ext_http.c
@@ -460,7 +460,7 @@
     for (size_t i = 0; i < nlen; i++) {
         unsigned char c = (unsigned char)name->data.str[i];
         if (!((c >= 'A' && c <= 'Z') || (c >= 'a' && c <= 'z') ||
-              (c >= '0' && c <= '9') || strchr("!#$%&'*+-.^_`|~", c)))
+              (c >= '0' && c <= '9') || strchr("!#$%&'*+-.^_`|~(),/;<=>?@[\\]{}", c)))
             return response_header_error(EK_VALUE, "name must be an RFC 7230 token");
     }
     if (vlen > HTTP_RESPONSE_VALUE_MAX)
