tests/http_readiness_mutants/shed-body-on-head.patch
diff --git a/src/ext_http.c b/src/ext_http.c
--- a/src/ext_http.c
+++ b/src/ext_http.c
@@ -284,15 +284,11 @@
 static void init_conn_shed(Server *s, int fd) {
-    /* Capacity shed does not read the request, so HEAD and GET must produce
-     * the same wire image: 503, Retry-After, Content-Length 0, no body.
-     * The write is non-blocking: a peer that is not reading is closed. */
-    (void)s;
-    tls_write_nowait = 1;
-    tls_suppress_body = 1;
-    send_response_full(fd, 503, "Service Unavailable", "text/plain",
-                       "", 0, 1, "Retry-After: 1\r\n");
-    tls_write_nowait = 0;
-    tls_suppress_body = 0;
-    close(fd);
+    InitConn extra;
+    extra.fd = fd;
+    extra.line = NULL;
+    extra.used = 0;
+    extra.cap = 0;
+    extra.deadline = 0;
+    init_conn_reply(s, &extra, 0);
 }
 
 static void *init_responder(void *arg) {
