tests/http_readiness_mutants/shed-write-blocking.patch
diff --git a/src/ext_http.c b/src/ext_http.c
--- a/src/ext_http.c
+++ b/src/ext_http.c
@@ -286,8 +286,6 @@
      * The write is non-blocking: a peer that is not reading is closed. */
     (void)s;
-    tls_write_nowait = 1;
     tls_suppress_body = 1;
     send_response_full(fd, 503, "Service Unavailable", "text/plain",
                        "", 0, 1, "Retry-After: 1\r\n");
-    tls_write_nowait = 0;
     tls_suppress_body = 0;
     close(fd);
