tests/http_readiness_mutants/shed-write-deadline-off.patch
diff --git a/src/ext_http.c b/src/ext_http.c
--- a/src/ext_http.c
+++ b/src/ext_http.c
@@ -267,7 +267,6 @@
      * the same wire image: 503, Retry-After, Content-Length 0, no body. */
     (void)s;
     struct timeval tv = { .tv_sec = 1, .tv_usec = 0 };
-    setsockopt(fd, SOL_SOCKET, SO_SNDTIMEO, &tv, sizeof(tv));
     tls_suppress_body = 1;
     send_response_full(fd, 503, "Service Unavailable", "text/plain",
                        "", 0, 1, "Retry-After: 1\r\n");
