tests/http_readiness_mutants/sigpipe-default-in-init.patch
diff --git a/src/ext_http.c b/src/ext_http.c
--- a/src/ext_http.c
+++ b/src/ext_http.c
@@ -562,7 +562,6 @@
     g_server.early_bind_fd = server_fd;
     g_server.liveness_path = live_path ? xstrdup(live_path) : NULL;
     __atomic_store_n(&g_server.init_stop, 0, __ATOMIC_RELEASE);
-    signal(SIGPIPE, SIG_IGN);
     if (pthread_create(&g_server.init_tid, NULL, init_responder, eigs_http_active) != 0) {
         close(server_fd);
         g_server.early_bind_fd = -1;
